grevaillot/svd_tools/headers/STM32H753x/nvic.h
#define NVIC_IPR25_IPR_N3_SHIFT		24
#define NVIC_IPR25_IPR_N3_MASK		0xff
/** @defgroup nvic_ipr25_ipr_n3 IPRN3 IPR_N3
@{*/
/**@}*/


#define NVIC_IPR25_IPR_N2_SHIFT		16
#define NVIC_IPR25_IPR_N2_MASK		0xff
/** @defgroup nvic_ipr25_ipr_n2 IPRN2 IPR_N2
@{*/
/**@}*/


#define NVIC_IPR25_IPR_N1_SHIFT		8
#define NVIC_IPR25_IPR_N1_MASK		0xff
/** @defgroup nvic_ipr25_ipr_n1 IPRN1 IPR_N1
@{*/
/**@}*/


#define NVIC_IPR25_IPR_N0_SHIFT		0
#define NVIC_IPR25_IPR_N0_MASK		0xff
/** @defgroup nvic_ipr25_ipr_n0 IPRN0 IPR_N0
@{*/
/**@}*/


/**@}*/

/** @defgroup nvic_ipr26 IPR26 Interrupt Priority Register
@{*/


#define NVIC_IPR26_IPR_N3_SHIFT		24
#define NVIC_IPR26_IPR_N3_MASK		0xff
/** @defgroup nvic_ipr26_ipr_n3 IPRN3 IPR_N3
@{*/
/**@}*/


#define NVIC_IPR26_IPR_N2_SHIFT		16
#define NVIC_IPR26_IPR_N2_MASK		0xff
/** @defgroup nvic_ipr26_ipr_n2 IPRN2 IPR_N2
@{*/
/**@}*/


#define NVIC_IPR26_IPR_N1_SHIFT		8
#define NVIC_IPR26_IPR_N1_MASK		0xff
/** @defgroup nvic_ipr26_ipr_n1 IPRN1 IPR_N1
@{*/
/**@}*/


#define NVIC_IPR26_IPR_N0_SHIFT		0
#define NVIC_IPR26_IPR_N0_MASK		0xff
/** @defgroup nvic_ipr26_ipr_n0 IPRN0 IPR_N0
@{*/
/**@}*/


/**@}*/

/** @defgroup nvic_ipr27 IPR27 Interrupt Priority Register
@{*/


#define NVIC_IPR27_IPR_N3_SHIFT		24
#define NVIC_IPR27_IPR_N3_MASK		0xff
/** @defgroup nvic_ipr27_ipr_n3 IPRN3 IPR_N3
@{*/
/**@}*/


#define NVIC_IPR27_IPR_N2_SHIFT		16
#define NVIC_IPR27_IPR_N2_MASK		0xff
/** @defgroup nvic_ipr27_ipr_n2 IPRN2 IPR_N2
@{*/
/**@}*/


#define NVIC_IPR27_IPR_N1_SHIFT		8
#define NVIC_IPR27_IPR_N1_MASK		0xff
/** @defgroup nvic_ipr27_ipr_n1 IPRN1 IPR_N1
@{*/
/**@}*/


#define NVIC_IPR27_IPR_N0_SHIFT		0
#define NVIC_IPR27_IPR_N0_MASK		0xff
/** @defgroup nvic_ipr27_ipr_n0 IPRN0 IPR_N0
@{*/
/**@}*/


/**@}*/

/** @defgroup nvic_ipr28 IPR28 Interrupt Priority Register
@{*/


#define NVIC_IPR28_IPR_N3_SHIFT		24
#define NVIC_IPR28_IPR_N3_MASK		0xff
/** @defgroup nvic_ipr28_ipr_n3 IPRN3 IPR_N3
@{*/
/**@}*/


#define NVIC_IPR28_IPR_N2_SHIFT		16
#define NVIC_IPR28_IPR_N2_MASK		0xff
/** @defgroup nvic_ipr28_ipr_n2 IPRN2 IPR_N2
@{*/
/**@}*/


#define NVIC_IPR28_IPR_N1_SHIFT		8
#define NVIC_IPR28_IPR_N1_MASK		0xff
/** @defgroup nvic_ipr28_ipr_n1 IPRN1 IPR_N1
@{*/
/**@}*/


#define NVIC_IPR28_IPR_N0_SHIFT		0
#define NVIC_IPR28_IPR_N0_MASK		0xff
/** @defgroup nvic_ipr28_ipr_n0 IPRN0 IPR_N0
@{*/
/**@}*/


/**@}*/

/** @defgroup nvic_ipr29 IPR29 Interrupt Priority Register
@{*/


#define NVIC_IPR29_IPR_N3_SHIFT		24
#define NVIC_IPR29_IPR_N3_MASK		0xff
/** @defgroup nvic_ipr29_ipr_n3 IPRN3 IPR_N3
@{*/
/**@}*/


#define NVIC_IPR29_IPR_N2_SHIFT		16
#define NVIC_IPR29_IPR_N2_MASK		0xff
/** @defgroup nvic_ipr29_ipr_n2 IPRN2 IPR_N2
@{*/
/**@}*/


#define NVIC_IPR29_IPR_N1_SHIFT		8
#define NVIC_IPR29_IPR_N1_MASK		0xff
/** @defgroup nvic_ipr29_ipr_n1 IPRN1 IPR_N1
@{*/
/**@}*/


#define NVIC_IPR29_IPR_N0_SHIFT		0
#define NVIC_IPR29_IPR_N0_MASK		0xff
/** @defgroup nvic_ipr29_ipr_n0 IPRN0 IPR_N0
@{*/
/**@}*/


/**@}*/

/** @defgroup nvic_ipr30 IPR30 Interrupt Priority Register
@{*/


#define NVIC_IPR30_IPR_N3_SHIFT		24
#define NVIC_IPR30_IPR_N3_MASK		0xff
/** @defgroup nvic_ipr30_ipr_n3 IPRN3 IPR_N3
@{*/
/**@}*/


#define NVIC_IPR30_IPR_N2_SHIFT		16
#define NVIC_IPR30_IPR_N2_MASK		0xff
/** @defgroup nvic_ipr30_ipr_n2 IPRN2 IPR_N2
@{*/
/**@}*/


#define NVIC_IPR30_IPR_N1_SHIFT		8
#define NVIC_IPR30_IPR_N1_MASK		0xff
/** @defgroup nvic_ipr30_ipr_n1 IPRN1 IPR_N1
@{*/
/**@}*/


#define NVIC_IPR30_IPR_N0_SHIFT		0
#define NVIC_IPR30_IPR_N0_MASK		0xff
/** @defgroup nvic_ipr30_ipr_n0 IPRN0 IPR_N0
@{*/
/**@}*/


/**@}*/

/** @defgroup nvic_ipr31 IPR31 Interrupt Priority Register
@{*/


#define NVIC_IPR31_IPR_N3_SHIFT		24
#define NVIC_IPR31_IPR_N3_MASK		0xff
/** @defgroup nvic_ipr31_ipr_n3 IPRN3 IPR_N3
@{*/
/**@}*/


#define NVIC_IPR31_IPR_N2_SHIFT		16
#define NVIC_IPR31_IPR_N2_MASK		0xff
/** @defgroup nvic_ipr31_ipr_n2 IPRN2 IPR_N2
@{*/
/**@}*/


#define NVIC_IPR31_IPR_N1_SHIFT		8
#define NVIC_IPR31_IPR_N1_MASK		0xff
/** @defgroup nvic_ipr31_ipr_n1 IPRN1 IPR_N1
@{*/
/**@}*/


#define NVIC_IPR31_IPR_N0_SHIFT		0
#define NVIC_IPR31_IPR_N0_MASK		0xff
/** @defgroup nvic_ipr31_ipr_n0 IPRN0 IPR_N0
@{*/
/**@}*/


/**@}*/

/** @defgroup nvic_ipr32 IPR32 Interrupt Priority Register
@{*/


#define NVIC_IPR32_IPR_N3_SHIFT		24
#define NVIC_IPR32_IPR_N3_MASK		0xff
/** @defgroup nvic_ipr32_ipr_n3 IPRN3 IPR_N3
@{*/
/**@}*/


#define NVIC_IPR32_IPR_N2_SHIFT		16
#define NVIC_IPR32_IPR_N2_MASK		0xff
/** @defgroup nvic_ipr32_ipr_n2 IPRN2 IPR_N2
@{*/
/**@}*/


#define NVIC_IPR32_IPR_N1_SHIFT		8
#define NVIC_IPR32_IPR_N1_MASK		0xff
/** @defgroup nvic_ipr32_ipr_n1 IPRN1 IPR_N1
@{*/
/**@}*/


#define NVIC_IPR32_IPR_N0_SHIFT		0
#define NVIC_IPR32_IPR_N0_MASK		0xff
/** @defgroup nvic_ipr32_ipr_n0 IPRN0 IPR_N0
@{*/
/**@}*/


/**@}*/

/** @defgroup nvic_ipr33 IPR33 Interrupt Priority Register
@{*/


#define NVIC_IPR33_IPR_N3_SHIFT		24
#define NVIC_IPR33_IPR_N3_MASK		0xff
/** @defgroup nvic_ipr33_ipr_n3 IPRN3 IPR_N3
@{*/
/**@}*/


#define NVIC_IPR33_IPR_N2_SHIFT		16
#define NVIC_IPR33_IPR_N2_MASK		0xff
/** @defgroup nvic_ipr33_ipr_n2 IPRN2 IPR_N2
@{*/
/**@}*/


#define NVIC_IPR33_IPR_N1_SHIFT		8
#define NVIC_IPR33_IPR_N1_MASK		0xff
/** @defgroup nvic_ipr33_ipr_n1 IPRN1 IPR_N1
@{*/
/**@}*/


#define NVIC_IPR33_IPR_N0_SHIFT		0
#define NVIC_IPR33_IPR_N0_MASK		0xff
/** @defgroup nvic_ipr33_ipr_n0 IPRN0 IPR_N0
@{*/
/**@}*/


/**@}*/

/** @defgroup nvic_ipr34 IPR34 Interrupt Priority Register
@{*/


#define NVIC_IPR34_IPR_N3_SHIFT		24
#define NVIC_IPR34_IPR_N3_MASK		0xff
/** @defgroup nvic_ipr34_ipr_n3 IPRN3 IPR_N3
@{*/
/**@}*/


#define NVIC_IPR34_IPR_N2_SHIFT		16
#define NVIC_IPR34_IPR_N2_MASK		0xff
/** @defgroup nvic_ipr34_ipr_n2 IPRN2 IPR_N2
@{*/
/**@}*/


#define NVIC_IPR34_IPR_N1_SHIFT		8
#define NVIC_IPR34_IPR_N1_MASK		0xff
/** @defgroup nvic_ipr34_ipr_n1 IPRN1 IPR_N1
@{*/
/**@}*/


#define NVIC_IPR34_IPR_N0_SHIFT		0
#define NVIC_IPR34_IPR_N0_MASK		0xff
/** @defgroup nvic_ipr34_ipr_n0 IPRN0 IPR_N0
@{*/
/**@}*/


/**@}*/

/** @defgroup nvic_ipr35 IPR35 Interrupt Priority Register
@{*/


