grevaillot/svd_tools/headers/STM32H753x/nvic.h
#define NVIC_IPR35_IPR_N3_SHIFT		24
#define NVIC_IPR35_IPR_N3_MASK		0xff
/** @defgroup nvic_ipr35_ipr_n3 IPRN3 IPR_N3
@{*/
/**@}*/


#define NVIC_IPR35_IPR_N2_SHIFT		16
#define NVIC_IPR35_IPR_N2_MASK		0xff
/** @defgroup nvic_ipr35_ipr_n2 IPRN2 IPR_N2
@{*/
/**@}*/


#define NVIC_IPR35_IPR_N1_SHIFT		8
#define NVIC_IPR35_IPR_N1_MASK		0xff
/** @defgroup nvic_ipr35_ipr_n1 IPRN1 IPR_N1
@{*/
/**@}*/


#define NVIC_IPR35_IPR_N0_SHIFT		0
#define NVIC_IPR35_IPR_N0_MASK		0xff
/** @defgroup nvic_ipr35_ipr_n0 IPRN0 IPR_N0
@{*/
/**@}*/


/**@}*/

/** @defgroup nvic_ipr36 IPR36 Interrupt Priority Register
@{*/


#define NVIC_IPR36_IPR_N3_SHIFT		24
#define NVIC_IPR36_IPR_N3_MASK		0xff
/** @defgroup nvic_ipr36_ipr_n3 IPRN3 IPR_N3
@{*/
/**@}*/


#define NVIC_IPR36_IPR_N2_SHIFT		16
#define NVIC_IPR36_IPR_N2_MASK		0xff
/** @defgroup nvic_ipr36_ipr_n2 IPRN2 IPR_N2
@{*/
/**@}*/


#define NVIC_IPR36_IPR_N1_SHIFT		8
#define NVIC_IPR36_IPR_N1_MASK		0xff
/** @defgroup nvic_ipr36_ipr_n1 IPRN1 IPR_N1
@{*/
/**@}*/


#define NVIC_IPR36_IPR_N0_SHIFT		0
#define NVIC_IPR36_IPR_N0_MASK		0xff
/** @defgroup nvic_ipr36_ipr_n0 IPRN0 IPR_N0
@{*/
/**@}*/


/**@}*/

/** @defgroup nvic_ipr37 IPR37 Interrupt Priority Register
@{*/


#define NVIC_IPR37_IPR_N3_SHIFT		24
#define NVIC_IPR37_IPR_N3_MASK		0xff
/** @defgroup nvic_ipr37_ipr_n3 IPRN3 IPR_N3
@{*/
/**@}*/


#define NVIC_IPR37_IPR_N2_SHIFT		16
#define NVIC_IPR37_IPR_N2_MASK		0xff
/** @defgroup nvic_ipr37_ipr_n2 IPRN2 IPR_N2
@{*/
/**@}*/


#define NVIC_IPR37_IPR_N1_SHIFT		8
#define NVIC_IPR37_IPR_N1_MASK		0xff
/** @defgroup nvic_ipr37_ipr_n1 IPRN1 IPR_N1
@{*/
/**@}*/


#define NVIC_IPR37_IPR_N0_SHIFT		0
#define NVIC_IPR37_IPR_N0_MASK		0xff
/** @defgroup nvic_ipr37_ipr_n0 IPRN0 IPR_N0
@{*/
/**@}*/


/**@}*/

/** @defgroup nvic_ipr38 IPR38 Interrupt Priority Register
@{*/


#define NVIC_IPR38_IPR_N3_SHIFT		24
#define NVIC_IPR38_IPR_N3_MASK		0xff
/** @defgroup nvic_ipr38_ipr_n3 IPRN3 IPR_N3
@{*/
/**@}*/


#define NVIC_IPR38_IPR_N2_SHIFT		16
#define NVIC_IPR38_IPR_N2_MASK		0xff
/** @defgroup nvic_ipr38_ipr_n2 IPRN2 IPR_N2
@{*/
/**@}*/


#define NVIC_IPR38_IPR_N1_SHIFT		8
#define NVIC_IPR38_IPR_N1_MASK		0xff
/** @defgroup nvic_ipr38_ipr_n1 IPRN1 IPR_N1
@{*/
/**@}*/


#define NVIC_IPR38_IPR_N0_SHIFT		0
#define NVIC_IPR38_IPR_N0_MASK		0xff
/** @defgroup nvic_ipr38_ipr_n0 IPRN0 IPR_N0
@{*/
/**@}*/


/**@}*/

/** @defgroup nvic_ipr39 IPR39 Interrupt Priority Register
@{*/


#define NVIC_IPR39_IPR_N3_SHIFT		24
#define NVIC_IPR39_IPR_N3_MASK		0xff
/** @defgroup nvic_ipr39_ipr_n3 IPRN3 IPR_N3
@{*/
/**@}*/


#define NVIC_IPR39_IPR_N2_SHIFT		16
#define NVIC_IPR39_IPR_N2_MASK		0xff
/** @defgroup nvic_ipr39_ipr_n2 IPRN2 IPR_N2
@{*/
/**@}*/


#define NVIC_IPR39_IPR_N1_SHIFT		8
#define NVIC_IPR39_IPR_N1_MASK		0xff
/** @defgroup nvic_ipr39_ipr_n1 IPRN1 IPR_N1
@{*/
/**@}*/


#define NVIC_IPR39_IPR_N0_SHIFT		0
#define NVIC_IPR39_IPR_N0_MASK		0xff
/** @defgroup nvic_ipr39_ipr_n0 IPRN0 IPR_N0
@{*/
/**@}*/


/**@}*/
